Revit 2027 API
ExternalDataManagerDataItem.ReferenceType Property
 The reference type of the data item (e.g. "Import", "Link", "Overlay", "Attachment").
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ReferenceType { get; set; }
Public Property ReferenceType As String
	Get
	Set
public:
property String^ ReferenceType {
	String^ get ();
	void set (String^ value);
}
member ReferenceType : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExternalDataManagerDataItem Class
Autodesk.Revit.UI Namespace